# RebarShapeSegment Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarShapeSegment Methods
RebarShapeSegment Class See Also
---
The RebarShapeSegment type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetConstraints | Retrieve the list of constraints associated with this segment. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| SetConstraints | Assign a new list of constraints to this segment. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
RebarShapeSegment Class
Autodesk.Revit.DB.Structure Namespace